#!/usr/bin/python3
# coding: utf-8

'''
divide by 111, q is 2r

首先看上下限
1000 = 999 + 1 = 111 x 9 + 1
9999 = 9990 + 9 = 111 x 90 + 9

題目說餘數是商的２倍
最小數是 111 x 9 + 18 = 1017

自然數除以111, 餘數最小餘0, 最大餘110,
但是商最多只能到 111/2=55 (因為題目要求餘數是商的2倍)
所以商最大可以取55，此時餘數可最大110
最大數是 111*55+110 = 6215

6215-1017=5198
'''

# 1115 = 10 * 111 + 5
# 9812 = 88 * 111 + 44

# 1017 = 9 * 111 + 18
# 6215 = 55 * 111 + 110

# 9999 = 111*90 + 9
# 1000 = 111*9  + 1

# r = [0 - 110]
# q = [0 - 55]


def main():
    ''' main '''
    lower = 1000
    upper = 10000
    #upper = 9000
    DIV = 111
    for i in range(lower, upper):
        q = i // DIV
        r = i % DIV
        if 2*q == r:
            print(f'{i} = {q} * 111 + {r}')


if __name__ == '__main__':
    main()
